AM1/constant/trisurface/AM1_concat.fms

3
(

wall wall

inlet patch

outlet patch
)


4672
(
(0.0027632 0.00487261 -0.00258688)
(0.00239291 0.00506474 -0.00258688)
(0.00200948 0.0052291 -0.00258688)
(0.00311836 0.00465377 -0.00258688)
(0.001615 0.00536481 -0.00258688)
(0.00345646 0.00440939 -0.00258688)
(0.00121161 0.00547113 -0.00258688)
(0.00377566 0.00414081 -0.00258688)
(0.000801486 0.00554749 -0.00258688)
(0.00407424 0.00384946 -0.00258688)
(0.000386858 0.00559347 -0.00258688)
(0.00435058 0.00353695 -0.00258688)
(0.0024683 0.00522414 -0.00218186)
(0.00285012 0.00502604 -0.00218186)
(0.00207294 0.00539362 -0.00218186)
(0.00321633 0.00480038 -0.00218186)
(0.00460319 0.00320495 -0.00258688)
(0.00166619 0.00553355 -0.00218186)
(0.00356494 0.0045484 -0.00218186)
(0.00125024 0.00564317 -0.00218186)
(0.00389408 0.00427146 -0.00218186)
(-3.0029e-05 0.00569917 -0.0023851)
(0.00231093 0.00489142 -0.00298535)
(0.0026687 0.0047058 -0.00298535)
(0.00483068 0.00285527 -0.00258688)
(-0.000493138 0.00558987 -0.00258688)
(0.00194048 0.00505022 -0.00298535)
(0.00301184 0.00449435 -0.00298535)
(0.000827359 0.00572191 -0.00218186)
(0.00420195 0.00397105 -0.00218186)
(0.00155934 0.00518134 -0.00298535)
(0.0033385 0.00425825 -0.00298535)
(0.0011696 0.00528406 -0.00298535)
(0.00364691 0.00399875 -0.00298535)
(0.00039983 0.00576933 -0.00218186)
(0.00448689 0.00364881 -0.00218186)
(0.00503183 0.0024898 -0.00258688)
(-0.00095315 0.00553313 -0.00258688)
(0.000773353 0.00535783 -0.00298535)
(0.00393539 0.00371726 -0.00298535)
(0.00474735 0.00330648 -0.00218186)
(0.000372754 0.00540226 -0.00298535)
(0.00420238 0.00341531 -0.00298535)
(0.00520555 0.00211052 -0.00258688)
(-0.00140699 0.005439 -0.00258688)
(-3.0029e-05 0.0054171 -0.00298535)
(0.00498192 0.00294592 -0.00218186)
(0.00444643 0.00309455 -0.00298535)
(-0.000507548 0.00576561 -0.00218186)
(0.0053509 0.00171949 -0.00258688)
(0.00466623 0.0027567 -0.00298535)
(-0.00047747 0.00539878 -0.00298535)
(0.00518933 0.00256908 -0.00218186)
(-0.000981874 0.00570711 -0.00218186)
(-0.00185161 0.00530808 -0.00258688)
(0.00486057 0.00240359 -0.00298535)
(-0.000921918 0.00534396 -0.00298535)
(0.00546709 0.00131883 -0.00258688)
(0.00536846 0.002178 -0.00218186)
(-0.00144983 0.00561004 -0.00218186)
(-0.00228405 0.00514127 -0.00258688)
(0.00502842 0.00203715 -0.00298535)
(-0.0013604 0.00525301 -0.00298535)
(0.00253535 0.00536591 -0.00177178)
(0.00292741 0.00516249 -0.00177178)
(0.00551833 0.0017748 -0.00218186)
(0.00555349 0.000910706 -0.00258688)
(0.00212938 0.00553993 -0.00177178)
(0.00330345 0.00493078 -0.00177178)
(0.00171171 0.00568362 -0.00177178)
(0.00366143 0.00467204 -0.00177178)
(-0.00190829 0.00547505 -0.00218186)
(0.00516885 0.00165935 -0.00298535)
(0.0012846 0.00579619 -0.00177178)
(0.0039994 0.00438766 -0.00177178)
(-0.00270141 0.00493967 -0.00258688)
(-0.00178998 0.00512653 -0.00298535)
(0.00085037 0.00587704 -0.00177178)
(0.00431553 0.00407919 -0.00177178)
(0.00563814 0.00136167 -0.00218186)
(0.00560964 0.00049733 -0.00258688)
(0.00528111 0.00127224 -0.00298535)
(0.000411366 0.00592572 -0.00177178)
(0.00460812 0.0037483 -0.00177178)
(-0.00235419 0.00530305 -0.00218186)
(-0.0031009 0.00470465 -0.00258688)
(-0.00220779 0.00496536 -0.00298535)
(0.00572723 0.000940849 -0.00218186)
(-3.0029e-05 0.00594198 -0.00177178)
(0.00487557 0.00339678 -0.00177178)
(0.00563522 8.09479e-05 -0.00258688)
(0.00536459 0.00087793 -0.00298535)
(-0.00278453 0.00509519 -0.00218186)
(0.00511644 0.00302654 -0.00177178)
(-0.000520364 0.00592191 -0.00177178)
(-0.00261103 0.00477059 -0.00298535)
(0.00578512 0.00051461 -0.00218186)
(-0.00347985 0.00443777 -0.00258688)
...
)


9340
(
((3533 3632 3638) 0)
((3533 3638 3535) 0)
((3535 3638 3644) 0)
((3535 3644 3537) 0)
((3537 3644 3650) 0)
((3537 3650 3539) 0)
((3539 3650 3656) 0)
((3539 3656 3541) 0)
((3541 3656 3662) 0)
((3541 3662 3543) 0)
((3543 3662 3668) 0)
((3543 3668 3545) 0)
((3545 3668 3674) 0)
((3545 3674 3547) 0)
((3547 3674 3680) 0)
((3547 3680 3549) 0)
((3549 3680 3686) 0)
((3549 3686 3551) 0)
((3551 3686 3692) 0)
((3551 3692 3553) 0)
((3553 3692 3698) 0)
((3553 3698 3555) 0)
((3555 3698 3704) 0)
((3555 3704 3557) 0)
((3557 3704 3710) 0)
((3557 3710 3559) 0)
((3559 3710 3716) 0)
((3559 3716 3561) 0)
((3561 3716 3722) 0)
((3561 3722 3563) 0)
((3563 3722 3728) 0)
((3563 3728 3565) 0)
((3565 3728 3734) 0)
((3565 3734 3567) 0)
((3567 3734 3740) 0)
((3567 3740 3569) 0)
((3569 3740 3746) 0)
((3569 3746 3571) 0)
((3571 3746 3752) 0)
((3571 3752 3572) 0)
((3572 3752 3747) 0)
((3572 3747 3570) 0)
((3570 3747 3741) 0)
((3570 3741 3568) 0)
((3568 3741 3735) 0)
((3568 3735 3566) 0)
((3566 3735 3729) 0)
((3566 3729 3564) 0)
((3564 3729 3723) 0)
((3564 3723 3562) 0)
((3562 3723 3717) 0)
((3562 3717 3560) 0)
((3560 3717 3711) 0)
((3560 3711 3558) 0)
((3558 3711 3705) 0)
((3558 3705 3556) 0)
((3556 3705 3699) 0)
((3556 3699 3554) 0)
((3554 3699 3693) 0)
((3554 3693 3552) 0)
((3552 3693 3687) 0)
((3552 3687 3550) 0)
((3550 3687 3681) 0)
((3550 3681 3548) 0)
((3548 3681 3675) 0)
((3548 3675 3546) 0)
((3546 3675 3669) 0)
((3546 3669 3544) 0)
((3544 3669 3663) 0)
((3544 3663 3542) 0)
((3542 3663 3657) 0)
((3542 3657 3540) 0)
((3540 3657 3651) 0)
((3540 3651 3538) 0)
((3538 3651 3645) 0)
((3538 3645 3536) 0)
((3536 3645 3639) 0)
((3536 3639 3534) 0)
((3534 3639 3633) 0)
((3534 3633 3532) 0)
((3532 3633 3627) 0)
((3532 3627 3530) 0)
((3530 3627 3621) 0)
((3530 3621 3528) 0)
((3528 3621 3620) 0)
((3528 3620 3529) 0)
((3529 3620 3626) 0)
((3529 3626 3531) 0)
((3531 3626 3632) 0)
((3531 3632 3533) 0)
((3535 3287 3285) 0)
((3535 3285 3533) 0)
((3533 3285 3283) 0)
((3533 3283 3531) 0)
((3531 3283 3281) 0)
((3531 3281 3529) 0)
((3529 3281 3279) 0)
((3529 3279 3528) 0)
...
)


912
(
(3279 3280)
(3279 3281)
(3280 3282)
(3281 3283)
(3282 3284)
(3283 3285)
(3284 3286)
(3285 3287)
(3286 3288)
(3287 3289)
(3288 3290)
(3289 3291)
(3290 3292)
(3291 3293)
(3292 3294)
(3293 3295)
(3294 3296)
(3295 3297)
(3296 3298)
(3297 3299)
(3298 3304)
(3299 3314)
(3304 3315)
(3314 3321)
(3315 3323)
(3321 3327)
(3323 3329)
(3327 3333)
(3329 3334)
(3333 3338)
(3334 3340)
(3338 3343)
(3340 3344)
(3343 3347)
(3344 3348)
(3347 3351)
(3348 3352)
(3351 3355)
(3352 3356)
(3355 3357)
(3356 3359)
(3357 3360)
(3359 3361)
(3360 3363)
(3361 3363)
(3618 3619)
(3618 3620)
(3619 3621)
(3620 3621)
(3620 3622)
(3620 3626)
(3621 3623)
(3621 3627)
(3622 3624)
(3623 3625)
(3624 3626)
(3625 3627)
(3626 3628)
(3626 3632)
(3627 3629)
(3627 3633)
(3628 3630)
(3629 3631)
(3630 3632)
(3631 3633)
(3632 3634)
(3632 3638)
(3633 3635)
(3633 3639)
(3634 3636)
(3635 3637)
(3636 3638)
(3637 3639)
(3638 3640)
(3638 3644)
(3639 3641)
(3639 3645)
(3640 3642)
(3641 3643)
(3642 3644)
(3643 3645)
(3644 3646)
(3644 3650)
(3645 3647)
(3645 3651)
(3646 3648)
(3647 3649)
(3648 3650)
(3649 3651)
(3650 3652)
(3650 3656)
(3651 3653)
(3651 3657)
(3652 3654)
(3653 3655)
(3654 3656)
(3655 3657)
(3656 3658)
...
)

0()
0()
0()
