AM1/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
	    default         steadyState;
}

gradSchemes
{
	    default         Gauss linear;
	    grad(p)         Gauss linear;
}

divSchemes
{
	    default				none;
	    div(phi,U)                          bounded Gauss linear;
	    div((nuEff*dev2(T(grad(U)))))       Gauss linear;
}

laplacianSchemes
{
	     default         Gauss linear orthogonal;
}

interpolationSchemes
{
	    default         linear;
}

snGradSchemes
{
	    default         orthogonal;
}

// ************************************************************************* //
