AM1/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;//ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p
    {
	    solver           GAMG;
	    tolerance        1e-6;
	    relTol           0.01;
	    smoother	     GaussSeidel;
	    nPreSweeps       0;
	    nPostSweeps      2;
	    cacheAgglomeration on;
	    agglomerator     faceAreaPair;
	    nCellsInCoarsestLevel 100; //1000;
	    mergeLevels      1;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }

}

SIMPLE
{
    nNonOrthogonalCorrectors 1;

    //consistent yes;

    residualControl
    {
        p               1e-4;
        U               1e-4;
    }
}

relaxationFactors
{
    fields
    {
        p               0.3; 
    }
    equations
    {
        U               0.7; 
    }

    //Relaxation factor tuned for simplec
}


// ************************************************************************* //
