AM1/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      meshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile   "constant/trisurface/AM1_concat.fms";

maxCellSize   3e-4;

localRefinement
{
        "wall.*"
        {
                additionalRefinementLevels 1;
                refinementThickness 3.5e-3;
        }
}

boundaryLayers
{
        optimiseLayer 1;
        untangleLayers 1;

        optimisationParameters
        {
                nSmoothNormals 5;
                maxNumIterations 10;
                reCalculateNormals 1;
        }
}

/*
surfaceMeshRefinement
{
	AM1_wall
	{
		surfaceFile	"constant/trisurface/AM1_concat.stl";
		additionalRefinementLevels	3;
	}
}
*/
